GIT/src/Enums/ВидЗаданийАвторизации/ВидЗаданийАвторизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЗаданийАвторизации</name>
  <enumValues>
    <name>Авторизация</name>
  </enumValues>
  <enumValues>
    <name>ВводКода</name>
  </enumValues>
</mdclass:Enum>

GIT/src/Enums/СтатусЗаданийАвторизации/СтатусЗаданийАвторизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаданийАвторизации</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

GIT/src/HTTPServices/auth/Module.bsl
Функция codeВводКода(Запрос)
	
	Код = "";
	Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
		
		Если Параметр.Ключ = "code" Тогда
			Код = Параметр.Значение;
		КонецЕсли;
		
	КонецЦикла;	
	
	Обработки.Авторизация.ЗаписатьЗадание(Перечисления.ВидЗаданийАвторизации.ВводКода, Перечисления.СтатусЗаданийАвторизации.Новое, Код);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция loginАвторизация(Запрос)	
	
	Обработки.Авторизация.ЗаписатьЗадание(Перечисления.ВидЗаданийАвторизации.Авторизация, Перечисления.СтатусЗаданийАвторизации.Новое);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;	
	
КонецФункции
